; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=267, out_folder=htg/blocksworld/training, instance_id=49, seed=2073, goal_proportion=0.03

(define (problem blocksworld-49)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 - object)
 (:init 
    (arm-empty)
    (clear b140)
    (on b140 b167)
    (on b167 b204)
    (on-table b204)
    (clear b66)
    (on b66 b17)
    (on-table b17)
    (clear b52)
    (on b52 b96)
    (on b96 b257)
    (on-table b257)
    (clear b95)
    (on b95 b125)
    (on b125 b213)
    (on b213 b9)
    (on b9 b144)
    (on-table b144)
    (clear b186)
    (on b186 b188)
    (on b188 b27)
    (on-table b27)
    (clear b262)
    (on b262 b219)
    (on-table b219)
    (clear b192)
    (on b192 b154)
    (on b154 b102)
    (on-table b102)
    (clear b184)
    (on b184 b201)
    (on-table b201)
    (clear b23)
    (on-table b23)
    (clear b148)
    (on b148 b241)
    (on b241 b4)
    (on b4 b33)
    (on b33 b31)
    (on-table b31)
    (clear b187)
    (on-table b187)
    (clear b56)
    (on b56 b103)
    (on b103 b245)
    (on b245 b146)
    (on b146 b195)
    (on b195 b222)
    (on-table b222)
    (clear b86)
    (on b86 b200)
    (on b200 b209)
    (on b209 b36)
    (on b36 b7)
    (on b7 b48)
    (on-table b48)
    (clear b160)
    (on-table b160)
    (clear b230)
    (on-table b230)
    (clear b90)
    (on b90 b183)
    (on b183 b111)
    (on b111 b129)
    (on-table b129)
    (clear b215)
    (on b215 b122)
    (on b122 b252)
    (on b252 b176)
    (on b176 b83)
    (on b83 b118)
    (on b118 b124)
    (on b124 b172)
    (on b172 b53)
    (on b53 b237)
    (on b237 b108)
    (on b108 b106)
    (on-table b106)
    (clear b76)
    (on b76 b182)
    (on b182 b64)
    (on b64 b231)
    (on b231 b126)
    (on b126 b234)
    (on b234 b71)
    (on b71 b35)
    (on b35 b139)
    (on b139 b202)
    (on b202 b217)
    (on b217 b37)
    (on-table b37)
    (clear b26)
    (on b26 b207)
    (on b207 b161)
    (on b161 b166)
    (on b166 b67)
    (on-table b67)
    (clear b145)
    (on b145 b194)
    (on b194 b143)
    (on b143 b177)
    (on b177 b105)
    (on b105 b248)
    (on-table b248)
    (clear b51)
    (on-table b51)
    (clear b251)
    (on-table b251)
    (clear b228)
    (on b228 b152)
    (on-table b152)
    (clear b15)
    (on b15 b109)
    (on b109 b168)
    (on b168 b40)
    (on b40 b74)
    (on b74 b151)
    (on b151 b113)
    (on b113 b191)
    (on b191 b250)
    (on b250 b72)
    (on b72 b16)
    (on-table b16)
    (clear b11)
    (on b11 b61)
    (on b61 b214)
    (on b214 b119)
    (on b119 b226)
    (on-table b226)
    (clear b39)
    (on b39 b254)
    (on b254 b238)
    (on b238 b78)
    (on b78 b98)
    (on b98 b84)
    (on b84 b224)
    (on b224 b19)
    (on b19 b137)
    (on b137 b77)
    (on b77 b3)
    (on b3 b135)
    (on b135 b112)
    (on-table b112)
    (clear b153)
    (on b153 b131)
    (on-table b131)
    (clear b265)
    (on-table b265)
    (clear b75)
    (on-table b75)
    (clear b221)
    (on b221 b236)
    (on b236 b261)
    (on b261 b159)
    (on b159 b216)
    (on-table b216)
    (clear b38)
    (on b38 b173)
    (on b173 b162)
    (on-table b162)
    (clear b190)
    (on b190 b29)
    (on b29 b150)
    (on b150 b121)
    (on-table b121)
    (clear b165)
    (on b165 b130)
    (on b130 b91)
    (on b91 b208)
    (on-table b208)
    (clear b138)
    (on b138 b227)
    (on b227 b12)
    (on b12 b47)
    (on b47 b24)
    (on b24 b65)
    (on b65 b55)
    (on b55 b240)
    (on-table b240)
    (clear b128)
    (on b128 b42)
    (on b42 b210)
    (on b210 b258)
    (on-table b258)
    (clear b107)
    (on b107 b134)
    (on b134 b163)
    (on b163 b117)
    (on b117 b142)
    (on b142 b218)
    (on b218 b28)
    (on-table b28)
    (clear b49)
    (on b49 b59)
    (on b59 b110)
    (on b110 b197)
    (on b197 b199)
    (on b199 b164)
    (on b164 b232)
    (on b232 b21)
    (on-table b21)
    (clear b157)
    (on b157 b89)
    (on b89 b247)
    (on-table b247)
    (clear b93)
    (on b93 b97)
    (on b97 b179)
    (on b179 b174)
    (on b174 b127)
    (on b127 b198)
    (on-table b198)
    (clear b242)
    (on-table b242)
    (clear b79)
    (on b79 b22)
    (on b22 b123)
    (on b123 b205)
    (on b205 b10)
    (on b10 b41)
    (on b41 b30)
    (on b30 b20)
    (on b20 b114)
    (on b114 b63)
    (on-table b63)
    (clear b255)
    (on b255 b1)
    (on b1 b149)
    (on b149 b46)
    (on b46 b206)
    (on-table b206)
    (clear b256)
    (on b256 b223)
    (on b223 b82)
    (on b82 b87)
    (on-table b87)
    (clear b57)
    (on b57 b136)
    (on b136 b239)
    (on b239 b43)
    (on b43 b193)
    (on b193 b203)
    (on b203 b88)
    (on b88 b253)
    (on b253 b266)
    (on b266 b6)
    (on b6 b147)
    (on b147 b211)
    (on b211 b116)
    (on b116 b233)
    (on-table b233)
    (clear b196)
    (on b196 b156)
    (on b156 b189)
    (on b189 b185)
    (on b185 b70)
    (on b70 b62)
    (on b62 b158)
    (on b158 b246)
    (on-table b246)
    (clear b263)
    (on b263 b264)
    (on b264 b120)
    (on b120 b5)
    (on b5 b115)
    (on b115 b229)
    (on b229 b171)
    (on b171 b170)
    (on b170 b54)
    (on b54 b133)
    (on b133 b32)
    (on-table b32)
    (clear b180)
    (on b180 b100)
    (on b100 b80)
    (on b80 b68)
    (on b68 b34)
    (on b34 b212)
    (on b212 b267)
    (on b267 b132)
    (on b132 b18)
    (on b18 b175)
    (on b175 b169)
    (on b169 b260)
    (on b260 b178)
    (on b178 b155)
    (on b155 b2)
    (on b2 b58)
    (on b58 b243)
    (on-table b243)
    (clear b92)
    (on-table b92)
    (clear b244)
    (on b244 b45)
    (on b45 b69)
    (on b69 b225)
    (on b225 b249)
    (on b249 b85)
    (on b85 b94)
    (on b94 b99)
    (on b99 b14)
    (on b14 b73)
    (on-table b73)
    (clear b60)
    (on b60 b8)
    (on b8 b235)
    (on-table b235)
    (clear b81)
    (on b81 b181)
    (on b181 b220)
    (on b220 b141)
    (on-table b141)
    (clear b50)
    (on b50 b101)
    (on b101 b44)
    (on b44 b13)
    (on-table b13)
    (clear b25)
    (on-table b25)
    (clear b259)
    (on-table b259)
    (clear b104)
    (on-table b104))
 (:goal  (and 
    (clear b2)
    (on b2 b8)
    (on b8 b5)
    (on b5 b7)
    (on-table b7)
    (clear b4)
    (on-table b4)
    (clear b6)
    (on b6 b1)
    (on b1 b3)
    (on-table b3))))

; plan
1. (unstack b148 b241)
   deleted: (on b148 b241) (clear b148) (arm-empty)
   added: (holding b148) (clear b241)
   goals met: 0 of 11
2. (putdown b148)
   deleted: (holding b148)
   added: (clear b148) (arm-empty) (on-table b148)
   goals met: 0 of 11
3. (unstack b180 b100)
   deleted: (on b180 b100) (clear b180) (arm-empty)
   added: (holding b180) (clear b100)
   goals met: 0 of 11
4. (putdown b180)
   deleted: (holding b180)
   added: (clear b180) (arm-empty) (on-table b180)
   goals met: 0 of 11
5. (unstack b100 b80)
   deleted: (on b100 b80) (clear b100) (arm-empty)
   added: (holding b100) (clear b80)
   goals met: 0 of 11
6. (putdown b100)
   deleted: (holding b100)
   added: (clear b100) (arm-empty) (on-table b100)
   goals met: 0 of 11
7. (unstack b241 b4)
   deleted: (on b241 b4) (clear b241) (arm-empty)
   added: (holding b241) (clear b4)
   goals met: 1 of 11
8. (putdown b241)
   deleted: (holding b241)
   added: (clear b241) (arm-empty) (on-table b241)
   goals met: 1 of 11
9. (unstack b4 b33)
   deleted: (on b4 b33) (clear b4) (arm-empty)
   added: (holding b4) (clear b33)
   goals met: 0 of 11
10. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 2 of 11
11. (unstack b255 b1)
   deleted: (on b255 b1) (clear b255) (arm-empty)
   added: (holding b255) (clear b1)
   goals met: 2 of 11
12. (putdown b255)
   deleted: (holding b255)
   added: (clear b255) (arm-empty) (on-table b255)
   goals met: 2 of 11
13. (unstack b263 b264)
   deleted: (on b263 b264) (clear b263) (arm-empty)
   added: (holding b263) (clear b264)
   goals met: 2 of 11
14. (putdown b263)
   deleted: (holding b263)
   added: (clear b263) (arm-empty) (on-table b263)
   goals met: 2 of 11
15. (unstack b264 b120)
   deleted: (on b264 b120) (clear b264) (arm-empty)
   added: (holding b264) (clear b120)
   goals met: 2 of 11
16. (putdown b264)
   deleted: (holding b264)
   added: (clear b264) (arm-empty) (on-table b264)
   goals met: 2 of 11
17. (unstack b120 b5)
   deleted: (on b120 b5) (clear b120) (arm-empty)
   added: (holding b120) (clear b5)
   goals met: 2 of 11
18. (putdown b120)
   deleted: (holding b120)
   added: (clear b120) (arm-empty) (on-table b120)
   goals met: 2 of 11
19. (unstack b39 b254)
   deleted: (on b39 b254) (clear b39) (arm-empty)
   added: (holding b39) (clear b254)
   goals met: 2 of 11
20. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 2 of 11
21. (unstack b254 b238)
   deleted: (on b254 b238) (clear b254) (arm-empty)
   added: (holding b254) (clear b238)
   goals met: 2 of 11
22. (putdown b254)
   deleted: (holding b254)
   added: (clear b254) (arm-empty) (on-table b254)
   goals met: 2 of 11
23. (unstack b238 b78)
   deleted: (on b238 b78) (clear b238) (arm-empty)
   added: (holding b238) (clear b78)
   goals met: 2 of 11
24. (putdown b238)
   deleted: (holding b238)
   added: (clear b238) (arm-empty) (on-table b238)
   goals met: 2 of 11
25. (unstack b57 b136)
   deleted: (on b57 b136) (clear b57) (arm-empty)
   added: (holding b57) (clear b136)
   goals met: 2 of 11
26. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 2 of 11
27. (unstack b136 b239)
   deleted: (on b136 b239) (clear b136) (arm-empty)
   added: (holding b136) (clear b239)
   goals met: 2 of 11
28. (putdown b136)
   deleted: (holding b136)
   added: (clear b136) (arm-empty) (on-table b136)
   goals met: 2 of 11
29. (unstack b239 b43)
   deleted: (on b239 b43) (clear b239) (arm-empty)
   added: (holding b239) (clear b43)
   goals met: 2 of 11
30. (putdown b239)
   deleted: (holding b239)
   added: (clear b239) (arm-empty) (on-table b239)
   goals met: 2 of 11
31. (unstack b43 b193)
   deleted: (on b43 b193) (clear b43) (arm-empty)
   added: (holding b43) (clear b193)
   goals met: 2 of 11
32. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 2 of 11
33. (unstack b193 b203)
   deleted: (on b193 b203) (clear b193) (arm-empty)
   added: (holding b193) (clear b203)
   goals met: 2 of 11
34. (putdown b193)
   deleted: (holding b193)
   added: (clear b193) (arm-empty) (on-table b193)
   goals met: 2 of 11
35. (unstack b203 b88)
   deleted: (on b203 b88) (clear b203) (arm-empty)
   added: (holding b203) (clear b88)
   goals met: 2 of 11
36. (putdown b203)
   deleted: (holding b203)
   added: (clear b203) (arm-empty) (on-table b203)
   goals met: 2 of 11
37. (unstack b60 b8)
   deleted: (on b60 b8) (clear b60) (arm-empty)
   added: (holding b60) (clear b8)
   goals met: 2 of 11
38. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 2 of 11
39. (unstack b78 b98)
   deleted: (on b78 b98) (clear b78) (arm-empty)
   added: (holding b78) (clear b98)
   goals met: 2 of 11
40. (putdown b78)
   deleted: (holding b78)
   added: (clear b78) (arm-empty) (on-table b78)
   goals met: 2 of 11
41. (unstack b80 b68)
   deleted: (on b80 b68) (clear b80) (arm-empty)
   added: (holding b80) (clear b68)
   goals met: 2 of 11
42. (putdown b80)
   deleted: (holding b80)
   added: (clear b80) (arm-empty) (on-table b80)
   goals met: 2 of 11
43. (unstack b68 b34)
   deleted: (on b68 b34) (clear b68) (arm-empty)
   added: (holding b68) (clear b34)
   goals met: 2 of 11
44. (putdown b68)
   deleted: (holding b68)
   added: (clear b68) (arm-empty) (on-table b68)
   goals met: 2 of 11
45. (unstack b34 b212)
   deleted: (on b34 b212) (clear b34) (arm-empty)
   added: (holding b34) (clear b212)
   goals met: 2 of 11
46. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 2 of 11
47. (unstack b212 b267)
   deleted: (on b212 b267) (clear b212) (arm-empty)
   added: (holding b212) (clear b267)
   goals met: 2 of 11
48. (putdown b212)
   deleted: (holding b212)
   added: (clear b212) (arm-empty) (on-table b212)
   goals met: 2 of 11
49. (unstack b267 b132)
   deleted: (on b267 b132) (clear b267) (arm-empty)
   added: (holding b267) (clear b132)
   goals met: 2 of 11
50. (putdown b267)
   deleted: (holding b267)
   added: (clear b267) (arm-empty) (on-table b267)
   goals met: 2 of 11
51. (unstack b132 b18)
   deleted: (on b132 b18) (clear b132) (arm-empty)
   added: (holding b132) (clear b18)
   goals met: 2 of 11
52. (putdown b132)
   deleted: (holding b132)
   added: (clear b132) (arm-empty) (on-table b132)
   goals met: 2 of 11
53. (unstack b18 b175)
   deleted: (on b18 b175) (clear b18) (arm-empty)
   added: (holding b18) (clear b175)
   goals met: 2 of 11
54. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 2 of 11
55. (unstack b175 b169)
   deleted: (on b175 b169) (clear b175) (arm-empty)
   added: (holding b175) (clear b169)
   goals met: 2 of 11
56. (putdown b175)
   deleted: (holding b175)
   added: (clear b175) (arm-empty) (on-table b175)
   goals met: 2 of 11
57. (unstack b169 b260)
   deleted: (on b169 b260) (clear b169) (arm-empty)
   added: (holding b169) (clear b260)
   goals met: 2 of 11
58. (putdown b169)
   deleted: (holding b169)
   added: (clear b169) (arm-empty) (on-table b169)
   goals met: 2 of 11
59. (unstack b260 b178)
   deleted: (on b260 b178) (clear b260) (arm-empty)
   added: (holding b260) (clear b178)
   goals met: 2 of 11
60. (putdown b260)
   deleted: (holding b260)
   added: (clear b260) (arm-empty) (on-table b260)
   goals met: 2 of 11
61. (unstack b178 b155)
   deleted: (on b178 b155) (clear b178) (arm-empty)
   added: (holding b178) (clear b155)
   goals met: 2 of 11
62. (putdown b178)
   deleted: (holding b178)
   added: (clear b178) (arm-empty) (on-table b178)
   goals met: 2 of 11
63. (unstack b155 b2)
   deleted: (on b155 b2) (clear b155) (arm-empty)
   added: (holding b155) (clear b2)
   goals met: 3 of 11
64. (putdown b155)
   deleted: (holding b155)
   added: (clear b155) (arm-empty) (on-table b155)
   goals met: 3 of 11
65. (unstack b86 b200)
   deleted: (on b86 b200) (clear b86) (arm-empty)
   added: (holding b86) (clear b200)
   goals met: 3 of 11
66. (putdown b86)
   deleted: (holding b86)
   added: (clear b86) (arm-empty) (on-table b86)
   goals met: 3 of 11
67. (unstack b200 b209)
   deleted: (on b200 b209) (clear b200) (arm-empty)
   added: (holding b200) (clear b209)
   goals met: 3 of 11
68. (putdown b200)
   deleted: (holding b200)
   added: (clear b200) (arm-empty) (on-table b200)
   goals met: 3 of 11
69. (unstack b209 b36)
   deleted: (on b209 b36) (clear b209) (arm-empty)
   added: (holding b209) (clear b36)
   goals met: 3 of 11
70. (putdown b209)
   deleted: (holding b209)
   added: (clear b209) (arm-empty) (on-table b209)
   goals met: 3 of 11
71. (unstack b36 b7)
   deleted: (on b36 b7) (clear b36) (arm-empty)
   added: (holding b36) (clear b7)
   goals met: 3 of 11
72. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 3 of 11
73. (unstack b7 b48)
   deleted: (on b7 b48) (clear b7) (arm-empty)
   added: (holding b7) (clear b48)
   goals met: 3 of 11
74. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 4 of 11
75. (unstack b88 b253)
   deleted: (on b88 b253) (clear b88) (arm-empty)
   added: (holding b88) (clear b253)
   goals met: 4 of 11
76. (putdown b88)
   deleted: (holding b88)
   added: (clear b88) (arm-empty) (on-table b88)
   goals met: 4 of 11
77. (unstack b253 b266)
   deleted: (on b253 b266) (clear b253) (arm-empty)
   added: (holding b253) (clear b266)
   goals met: 4 of 11
78. (putdown b253)
   deleted: (holding b253)
   added: (clear b253) (arm-empty) (on-table b253)
   goals met: 4 of 11
79. (unstack b266 b6)
   deleted: (on b266 b6) (clear b266) (arm-empty)
   added: (holding b266) (clear b6)
   goals met: 5 of 11
80. (putdown b266)
   deleted: (holding b266)
   added: (clear b266) (arm-empty) (on-table b266)
   goals met: 5 of 11
81. (unstack b98 b84)
   deleted: (on b98 b84) (clear b98) (arm-empty)
   added: (holding b98) (clear b84)
   goals met: 5 of 11
82. (putdown b98)
   deleted: (holding b98)
   added: (clear b98) (arm-empty) (on-table b98)
   goals met: 5 of 11
83. (unstack b84 b224)
   deleted: (on b84 b224) (clear b84) (arm-empty)
   added: (holding b84) (clear b224)
   goals met: 5 of 11
84. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 5 of 11
85. (unstack b224 b19)
   deleted: (on b224 b19) (clear b224) (arm-empty)
   added: (holding b224) (clear b19)
   goals met: 5 of 11
86. (putdown b224)
   deleted: (holding b224)
   added: (clear b224) (arm-empty) (on-table b224)
   goals met: 5 of 11
87. (unstack b19 b137)
   deleted: (on b19 b137) (clear b19) (arm-empty)
   added: (holding b19) (clear b137)
   goals met: 5 of 11
88. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 5 of 11
89. (unstack b137 b77)
   deleted: (on b137 b77) (clear b137) (arm-empty)
   added: (holding b137) (clear b77)
   goals met: 5 of 11
90. (putdown b137)
   deleted: (holding b137)
   added: (clear b137) (arm-empty) (on-table b137)
   goals met: 5 of 11
91. (unstack b77 b3)
   deleted: (on b77 b3) (clear b77) (arm-empty)
   added: (holding b77) (clear b3)
   goals met: 5 of 11
92. (putdown b77)
   deleted: (holding b77)
   added: (clear b77) (arm-empty) (on-table b77)
   goals met: 5 of 11
93. (unstack b3 b135)
   deleted: (on b3 b135) (clear b3) (arm-empty)
   added: (holding b3) (clear b135)
   goals met: 5 of 11
94. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 6 of 11
95. (unstack b1 b149)
   deleted: (on b1 b149) (clear b1) (arm-empty)
   added: (holding b1) (clear b149)
   goals met: 6 of 11
96. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 7 of 11
97. (unstack b5 b115)
   deleted: (on b5 b115) (clear b5) (arm-empty)
   added: (holding b5) (clear b115)
   goals met: 7 of 11
98. (stack b5 b7)
   deleted: (clear b7) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b7)
   goals met: 8 of 11
99. (unstack b8 b235)
   deleted: (on b8 b235) (clear b8) (arm-empty)
   added: (holding b8) (clear b235)
   goals met: 8 of 11
100. (stack b8 b5)
   deleted: (clear b5) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b5)
   goals met: 9 of 11
101. (unstack b2 b58)
   deleted: (on b2 b58) (clear b2) (arm-empty)
   added: (holding b2) (clear b58)
   goals met: 8 of 11
102. (stack b2 b8)
   deleted: (clear b8) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b8)
   goals met: 10 of 11
103. (unstack b6 b147)
   deleted: (on b6 b147) (clear b6) (arm-empty)
   added: (holding b6) (clear b147)
   goals met: 9 of 11
104. (stack b6 b1)
   deleted: (clear b1) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b1)
   goals met: 11 of 11
